/* CSSM Error Core Names. */

1 = "internal error";
2 = "memory error";
3 = "MDS error";
4 = "invalid pointer";
5 = "invalid input pointer";
6 = "invalid output pointer";
7 = "function not implemented";
8 = "self-check failed";
9 = "OS access denied";
10 = "function failed";
11 = "module manifest verify failed";
12 = "invalid GUID";

32 = "operation authorisation denied";
33 = "object use authorisation denied";
34 = "object manipulation authorisation denied";
35 = "object ACL not supported";
36 = "object ACL required";
37 = "invalid access credentials";
38 = "invalid ACL base certificates";
39 = "ACL base certificates not supported";
40 = "invalid sample value";
41 = "sample value not supported";
42 = "invalid ACL subject value";
43 = "ACL subject type not supported";
44 = "invalid ACL challenge callback";
45 = "ACL challenge callback failed";
46 = "invalid ACL entry tag";
47 = "ACL entry tag not found";
48 = "invalid ACL edit mode";
49 = "ACL change failed";
50 = "invalid new ACL entry";
51 = "invalid new ACL owner";
52 = "ACL delete failed";
53 = "ACL replace failed";
54 = "ACL add failed";

64 = "invalid context handle";
65 = "incompatible version";
66 = "invalid certificate group pointer";
67 = "invalid certificate pointer";
68 = "invalid CRL pointer";
69 = "invalid field pointer";
70 = "invalid data";
71 = "CRL already signed";
72 = "invalid number of fields";
73 = "verification failure";
74 = "invalid DB handle";
75 = "privilege not granted";
76 = "invalid DB list";
77 = "invalid DB list pointer";
78 = "unknown format";
79 = "unknown tag";
80 = "invalid CSP handle";
81 = "invalid DL handle";
82 = "invalid CL handle";
83 = "invalid TP handle";
84 = "invalid KR handle";
85 = "invalid AC handle";
86 = "invalid passthrough ID";
87 = "invalid network address";
88 = "invalid cryptographic data";